posts/2015-01-13-the-fourth-sunday-of-easter.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: The Fourth Sunday of Easter

God of grace and love,\\
\\
History is filled\\
With names like\\
Alexander,\\
Hannibal,\\
Caesar,\\
Napoleon;\\
Men who took up arms,\\
And with violence,\\
Bent the world to their will.\\
\\
But history whispers\\
Of others,\\
The faceless ones,\\
Who were deemed\\
To insignificant to name.\\
\\
We think of the woman\\
Who, with her daughter,\\
Gave her son to the Nile,\\
Yet found a way to get him back,\\
And by saving her son,\\
Saved a people from their bondage.\\
\\
The world sees those\\
Who bear swords,\\
And calls them heroic.\\
What greater courage\\
Has the one\\
Who faces the sword\\
With compassion and love?\\

Amen
