docs/posts/2015-01-13-the-fourth-sunday-of-easter.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 31, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Fourth Sunday of Easter</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Fourth Sunday of Easter</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
God of grace and love,<br>
<br>
History is filled<br>
With names like<br>
Alexander,<br>
Hannibal,<br>
Caesar,<br>
Napoleon;<br>
Men who took up arms,<br>
And with violence,<br>
Bent the world to their will.<br>
<br>
But history whispers<br>
Of others,<br>
The faceless ones,<br>
Who were deemed<br>
To insignificant to name.<br>
<br>
We think of the woman<br>
Who, with her daughter,<br>
Gave her son to the Nile,<br>
Yet found a way to get him back,<br>
And by saving her son,<br>
Saved a people from their bondage.<br>
<br>
The world sees those<br>
Who bear swords,<br>
And calls them heroic.<br>
What greater courage<br>
Has the one<br>
Who faces the sword<br>
With compassion and love?<br>
</p>

<p>
Amen
</p>


<div class="tagline" id="org1ef7651">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 31, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
